{
	"Frontend development": {
		"hint": "Frontend development encompasses creating responsive, interactive user interfaces and seamless web experiences. Key focus areas include: implementing modern UI frameworks, managing client-side state, optimizing performance, ensuring cross-browser compatibility, handling user interactions, integrating APIs, implementing accessibility standards, and utilizing build tools for efficient development workflows. Frontend developers must balance visual aesthetics with technical performance while maintaining clean, maintainable code.",
		"examples": [
			"React",
			"Vue",
			"Angular",
			"html",
			"^css",
			"Tailwind",
			"Bootstrap",
			"Webpack",
			"jQuery",
			"Frontend|front-end|front end|фронтенд",
			"vite",
			"Redux",
			"Nuxt|next\\.js|nextjs",
			"pinia",
			"Svelte",
			"Single Page",
			"SSR",
			"верстка",
			"Sass|scss|^less",
			"state manage",
			"zustand",
			"mobx",
			"RTK",
			"axios",
			"vuex",
			"ngrx"
		]
	},
	"Backend development": {
		"hint": "Backend development involves building robust server-side applications that power web services and APIs. Core responsibilities include: designing scalable database architectures, implementing business logic and data processing, managing authentication/authorization, optimizing server performance, ensuring data security, developing microservices, handling background jobs, implementing caching strategies, and maintaining system reliability. Backend developers focus on creating efficient, secure, and maintainable server-side solutions.",
		"examples": [
			"Laravel",
			"Postgre",
			"MySQL",
			"FastAPI",
			"Redis",
			"Nest",
			"REST",
			"Mongo",
			"Backend|back-end|back end",
			"Memcached",
			"asp\\.net",
			"Symfony",
			"Django",
			"GraphQL",
			"swagger",
			"microservice|микросервис",
			"Spring",
			"Clickhouse"
		]
	},
	"DevOps & Infrastructure": {
		"hint": "DevOps and infrastructure management focuses on bridging development and operations through automation and efficient deployment practices. Key areas include: implementing CI/CD pipelines, managing cloud infrastructure as code, monitoring system health and performance, ensuring security compliance, orchestrating containerized applications, implementing disaster recovery, automating deployment processes, and optimizing resource utilization. DevOps engineers enable faster, more reliable software delivery while maintaining system stability.",
		"examples": [
			"Docker",
			"DevOps|девопс",
			"Kuber|k8s",
			"CI/CD",
			"Ansible",
			"Grafana",
			"Nginx",
			"Prometheus",
			"Jenkins",
			"Terraform",
			"helm",
			"openshift",
			"TeamCity",
			"OpenStack",
			"Tomcat",
			"Container",
			"IaC",
			"CircleCI",
			"swarm",
            "Infrastructure",
			"AgroCD",
			"Mosquitto",
			"Kustomize",
			"Digitaloc"
		]
	},
	"Data Science & Machine Learning": {
		"hint": "Data Science and Machine Learning combine statistical analysis with computational methods to extract insights and build predictive models. Core aspects include: developing machine learning algorithms, preprocessing and engineering features, training and evaluating models, implementing deep learning architectures, processing natural language and computer vision tasks, handling big data, managing experiment tracking, and deploying models to production. This field requires strong mathematical foundations and programming skills.",
		"examples": [
			"PyTorch",
			"Tensorflow",
			"pandas",
			"numpy",
			"catboost|xgboost|lightgbm",
			"^NLP|natural language",
			"scikit|sklearn",
			"^LLM",
			"(machine|deep) learning|машинное обучение|анализ данных",
			"data (scien|analysis)",
			"opencv",
			"computer vision",
			"mlflow",
			"keras",
			"neural|нейронные",
			"transformer",
			"yolo",
			"Hugging Face",
			"matplotlib",
			"jupyter",
			"classification",
			"seaborn",
			"scipy",
			"statsmodels",
			"regression",
			"data mining",
			"OpenAI",
			"CycleGAN"]
	},
	"Mobile development": {
		"hint": "Mobile development focuses on creating native and cross-platform applications for smartphones and tablets. Essential aspects include: implementing platform-specific UI guidelines, managing app lifecycle and state, optimizing mobile performance and battery usage, handling offline data synchronization, implementing secure data storage, integrating device features and sensors, managing push notifications, and ensuring smooth app distribution through various app stores. Mobile developers must balance user experience with technical constraints.",
		"examples": [
			"Android",
			"IOS",
			"Kotlin",
			"Swift",
			"Flutter",
			"Dart",
			"Xcode",
			"Objective-C",
			"React native",
			"Jetpack",
			"Coroutine",
			"^мобиль|Mobile",
			"Dagger",
			"Alamofire",
			"xamarin",
			"Ionic",
			"Moxy",
			"CocoaPods",
			"Combine",
			"Kodein",
			"Hilt",
			"Cicerone",
			"Kaspresso",
			"Timber",
			"Multiplatform"
		]
	},
	"Testing & Quality assurance": {
		"hint": "Quality Assurance focuses on software testing and quality control. Main aspects: - Test planning and strategy - Automated testing implementation - Manual testing execution - Performance testing - Security testing - Bug tracking and reporting - Test environment management - User acceptance testing - Integration testing - Regression testing",
		"examples": [
			"^QA|Quality Assurance",
			"selenium",
			"cypress",
			"allure",
			"pytest",
			"junit",
			"playwright",
			"^bug",
			"jmeter",
			"(Функциональное|Нефункциональное|Автоматизированное|Ручное|Регрессионное|Нагрузочное|Интеграционное|Кроссбраузерное|Кроссплатформенное) тестирование",
			"Selenide",
			"TestNG",
			"DevTools",
			"AutoQA",
			"Black box",
			"Test case",
			"(Политика|Методология) тестирования",
			"автотест|autotest",
			"WebDriver",
			"(Unit|Integration|Automation) Testing",
			"TestRail",
			"Gatling",
			"Cucumber",
			"Mocha",
			"Jest",
			"Jasmine",
			"Karma",
			"LoadRunner"
		]
	},
	"Computer graphics & Game development": {
		"hint": "Computer Graphics and Game Development focus on visual computing and gaming. Main aspects: - 3D graphics programming - Game engine development - Physics simulation - Animation systems - Shader programming - Asset optimization - Game mechanics implementation - Real-time rendering - Level design tools - Performance optimization",
		"examples": [
			"^unity",
			"unreal",
			"blender",
			"(2|3)d",
			"opengl",
			"webgl",
			"vulkan",
			"directx",
			"webgpu",
			"GLSL",
			"autodesk",
			"vfx",
			"^game|гейм",
			"реальность",
			"Shading",
			"Blueprint",
			"Low poly",
			"Substance",
			"Match-3",
			"playable",
			"Materials",
			"gamefi",
			"VR/AR",
			"ARCore",
			"GDevelop"
		]
	},
	"Blockchain": {
		"hint": "Blockchain development focuses on decentralized systems and smart contracts. Main aspects: - Smart contract development - Blockchain protocols - Cryptocurrency implementation - Decentralized applications - Consensus mechanisms - Cryptographic systems - Network security - Token standards - Web3 integration - Transaction management",
		"examples": [
			"crypto|криптова|криптоби|крипта|криптоэ",
			"blockchain|блокчейн",
			"web3|web 3",
			"^defi",
			"cosmos",
			"solidity",
			"ethereum|etherium|ethers|эфир",
			"solana",
			"^dex|decentral",
			"smart contract|смарт-кон|смарт кон|Contracts",
			"bitco|битко",
			"^evm",
			"Wormhole",
			"Truffle",
			"anchor-lang",
			"jito",
			"Infura",
			"Hardhat",
			"Foundry",
			"Raydium",
			"Bitcoin",
			"криптов|cryptocu"
		]
	},
	"Design": {
		"hint": "Design focuses on creating visual and user experience solutions. Main aspects: - User interface design - User experience planning - Visual design principles - Design system creation - Prototyping and wireframing - Typography and color theory - Interaction design - Responsive design - Brand identity - User research",
		"examples": [
			"Figma",
			"Photoshop",
			"Illustrator",
			"web-дизайн",
			"^UX",
			"^UI",
			"Tilda",
			"CorelDraw",
			"After Effects",
			"(Графический|Адаптивный) дизайн",
			"(Web|веб)-дизайн",
			"дизайн интерфейсов",
			"Разработка дизайн",
			"Инфографика",
			"Иллюстрирование",
			"Типографика",
			"логотип",
			"Векторная графика",
			"бренд",
			"design",
			"Zeplin"
		]
	},
	"System administration": {
		"hint": "System Administration focuses on maintaining computer systems and networks. Main aspects: - Server management - Network configuration - Security implementation - User access management - System monitoring - Backup and recovery - Performance tuning - Software deployment - Troubleshooting - Documentation",
		"examples": [
			"администрирование (сетевого|серверов|по)",
			"настройка (пк|сетевых)",
			"установка по",
			"zabbix",
			"active directory",
			"dhcp",
			"mikrotik",
			"техническая поддержка",
			"vmware",
			"ремонт пк",
			"установка драйверов",
			"(системное|системный) админ",
			"Мониторинг",
			"Резервное копирование|Бэкап",
			"Сборка",
			"Helpdesk",
			"устранение неполадок",
			"(Серверное|сетевое) оборудование",
			"Настройка (серверов|почтовых)",
			"Acronis",
			"Bacula"
		]
	},
	"Website administration": {
		"hint": "Website administration involves managing and maintaining web platforms and content management systems. Key responsibilities include: configuring and customizing CMS platforms, managing website content and updates, implementing security measures, monitoring website performance, managing user permissions, handling database maintenance, optimizing site speed, ensuring backup procedures, troubleshooting technical issues, and maintaining plugin/extension functionality. Website administrators bridge technical expertise with content management needs.",
		"examples": [
			"CMS",
			"bitrix|битрикс",
			"wordpress",
			"(администрирование|доработка|Поддержка) сайтов",
			"joomla",
			"opencart",
			"d7",
			"modx",
			"october",
			"Webasyst",
			"Cetera",
			"WooCommerce",
			"Drupal",
			"NetCat",
			"Добавление контента",
			"Написание модулей",
			"аспро",
			"Fastsite",
			"IspManager",
			"cs-cart",
			"Magento",
			"PrestaShop",
			"Shopify",
			"Контент-менеджмент",
			"Plesk"
		]
	},
	"1C Development": {
		"hint": "1C Development focuses on creating and customizing business applications using the 1C:Enterprise platform. Core aspects include: implementing business logic and accounting processes, developing custom modules and reports, integrating with external systems, optimizing database performance, creating user interfaces, handling data migration, implementing security controls, customizing standard configurations, and maintaining system documentation. 1C developers combine programming skills with understanding of business processes.",
		"examples": [
			"1c|1с",
			"Бухгалтерия и склад",
			"предприятие",
			"управление (торговлей|производственным|холдингом)",
			"документооборот",
			"зарплата и кадры",
			"розница",
			"торговля и склад",
			"Создание конфигурации",
			"Обновление конфигурации",
			"Зарплата и управление персоналом",
			"Розница",
			"Бухгалтерия",
			"Комплексная автоматизация",
			"Бухгалтерский Учет",
			"Бухгалтерия предприятия"
		]
	},
	"Systems analytics": {
		"hint": "System Analytics focuses on analyzing business needs and translating them into technical requirements. Key responsibilities include: gathering and documenting requirements, modeling business processes, creating system specifications, conducting gap analysis, designing solution architecture, facilitating communication between business and technical teams, evaluating system performance, managing change requests, creating technical documentation, and ensuring alignment between business goals and technical implementation. System analysts bridge business needs with technical solutions through structured analysis and documentation.",
		"examples": [
			"bpmn",
			"uml",
			"use case",
			"бизнес-анализ",
			"анализ требований",
			"бизнес процесс|бизнес-процесс",
			"бизнес-треб|бизнес треб",
			"SOAP",
			"Confluence",
			"Аналитическое мышление",
			"User Story",
			"Разработка функциональных требований",
			"Разработка нефункциональных требований",
			"Аналитика",
			"excel",
			"Draw.io",
			"MS Visio",
			"Сбор требований",
			"Системный а"
		]
	},
	"Systems programming": {
		"hint": "Systems Programming involves developing low-level software that interacts directly with hardware and operating systems. Core focuses include: developing device drivers, implementing embedded systems, optimizing memory management, writing efficient assembly code, developing real-time systems, implementing hardware interfaces, optimizing system performance, handling interrupt processing, developing bootloaders, and ensuring hardware compatibility. Systems programmers require deep understanding of computer architecture and operating systems.",
		"examples": [
			"embedded|встраиваемые системы|встроенного по",
			"iot",
			"x86",
			"системное программирование|системный программист",
			"kernel|ядро",
			"драйверы|Drivers",
			"reverse|Реверс",
			"RTOS",
			"OpenBMC",
			"Robotics",
			"Risc-V",
			"контроллер",
			"Yocto",
			"низкоуровневое",
			"Ассемблер|assembler|assembly",
			"схемотех",
			"RobotFramework",
			"Встраиваемое",
			"Simulink",
			"процессор",
			"raspber",
			"arduino",
			"Электроника",
			"радиотехника",
			"печатных плат",
			"bare metal",
			"FPGA"
		]
	},
	"Cybersecurity": {
		"hint": "Information Security focuses on protecting systems, networks, and data from threats and vulnerabilities. Essential aspects include: implementing security controls and protocols, conducting security assessments, managing incident response, implementing authentication systems, performing penetration testing, monitoring security events, implementing encryption, managing access controls, ensuring compliance with security standards, and developing security policies. Security professionals protect organizations from cyber threats while ensuring operational continuity.",
		"examples": [
			"security",
			"siem",
			"DevSecOps",
			"sast",
			"dast",
			"waf",
			"owasp",
			"Kaspersky",
			"IDS",
			"^IPS",
			"NGFW",
			"Arcsight",
			"ISO 27001",
			"AntiDDoS",
			"Bug Bounty",
			"безопасность",
			"защита|защиты",
			"Incident",
			"Acunetix",
			"Pentest",
			"Фишинг",
			"Kali",
			"DDoS",
			"^Kuma"
		]
	},
	"HR management": {
		"hint": "HR Management focuses on recruiting and employee management. Main aspects: - Talent acquisition - Employee onboarding - Performance management - Employee relations - Compensation and benefits - Employee engagement - HR policies and regulations - HR analytics - HR technology implementation - HR strategy development",
		"examples": [
			"^HR",
			"подбор",
			"найм",
			"рекрут",
			"поиск",
			"персонал",
			"сотрудник",
			"резюме",
			"собесед",
			"сорсинг",
			"Анализ рынка",
			"HeadHunt",
			"Хантфлоу",
			"onboard"
		]
	},
	"Project management": {
		"hint": "Project Management focuses on organizing and leading development efforts. Main aspects: - Project planning and scheduling - Resource allocation - Risk management - Team coordination - Stakeholder communication - Budget management - Quality control - Agile methodologies - Progress tracking - Change management",
		"examples": [
			"Agile",
			"Scrum",
			"kanban",
			"Roadmap",
			"PMBOK",
			"Waterfall",
			"Жизненный цикл",
			"project man|проектный мен|Управление IT|управления прое|управление прое|prodject man|Менеджер про",
			"Управление (разработкой|ожиданиями|ресурсами|процессами)",
			"постановка (целей|задач)",
			"управление командой|team manag",
			"trello",
			"жизненный цикл",
			"стейкхолд",
			"Confluence",
			"ms project",
			"тайм-мен",
			"people man",
			"risk man",
			"планирование рес",
			"Jira",
			"Asana",
			"ClickUp",
			"Notion",
			"Redmine",
			"YouTrack",
			"Miro"
		]
	},
	"Network administration": {
		"hint": "Network Administration focuses on managing and maintaining computer networks. Main aspects: - Network infrastructure design - Network topology - Network security - Network monitoring - Network troubleshooting - Network optimization - Network performance management - Network automation - Network configuration management - Network planning and scheduling",
		"examples": [
			"cisco",
			"tcp/ip",
			"сетев|network",
			"bgp",
			"ospf",
			"vpn",
			"huawei",
			"vlan",
			"dhcp",
			"dns",
			"VxLAN",
			"Маршрутизация",
			"StackWise",
			"tcpdump",
			"Aruba",
			"D-Link"
		]
	},
	"Digital Marketing & SEO": {
		"hint": "Marketing and SEO focus on promoting products and services. Main aspects: - SEO strategies and optimization - Content marketing - Social media marketing - Email marketing - Brand positioning - Lead generation - Conversion rate optimization - Marketing automation - Marketing analytics - Marketing campaign management",
		"examples": [
			"marketing|маркетинг",
			"seo",
			"google analytics",
			"оптимизация",
			"smm",
			"реклама",
			"таргетинг",
			"оптимизация сайта"
		]
	},
	"Other": {
		"hint":  "Other category encompasses non-technical and general business roles that fall outside specific IT domains. Main aspects: - Service and hospitality positions - Transportation and logistics roles - Physical security and protection - Customer service functions - Sales and retail operations - Financial services roles - Tourism and travel services - Administrative support - Manual labor positions - General business operations",
		"examples": [
			"Доставка|доставщик|курьер",
			"водитель|^вождение",
			"Стаж вождения",
			"кассовые",
			"туризм",
			"Охрана",
			"города",
			"автомоб",
			"такси",
			"официант",
			"Грузоперевозки",
			"Выкладка",
			"Деливери",
			"Такси",
			"Подработка",
			"любой район",
			"закупка",
			"Ежедневн",
			"Сборщик",
			"Бармен",
			"Выносливость",
			"Район на выбор",
			"Самокат",
			"Работа рядом",
			"(Приём|сбор) заказ",
			"Упаковка тов"
		]
	}
}